УТ_для_edt/src/Enums/CRM_ВариантыПоставки/CRM_ВариантыПоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВариантыПоставки</name>
  <enumValues>
    <name>СТАРТ</name>
  </enumValues>
  <enumValues>
    <name>ПРОФ</name>
  </enumValues>
  <enumValues>
    <name>КОРП</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/CRM_ВариантыПоставки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	Если Параметры.СтрокаПоиска = "" Тогда
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.СТАРТ);
		КонецЕсли;
		ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.ПРОФ);
		ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.КОРП);
	Иначе
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() И СтрНайти(Строка(Перечисления.CRM_ВариантыПоставки.СТАРТ), ВРег(Параметры.СтрокаПоиска))>0 Тогда
			ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.СТАРТ);
		КонецЕсли;
		Если СтрНайти(Строка(Перечисления.CRM_ВариантыПоставки.ПРОФ), ВРег(Параметры.СтрокаПоиска))>0 Тогда
			ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.ПРОФ);
		КонецЕсли;
		Если СтрНайти(Строка(Перечисления.CRM_ВариантыПоставки.КОРП), ВРег(Параметры.СтрокаПоиска))>0 Тогда
			ДанныеВыбора.Добавить(Перечисления.CRM_ВариантыПоставки.КОРП);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
